apache/nuttx/arch/arm/src/stm32u5/hardware/stm32u5_tim.h
/* Register Addresses *******************************************************/

/* Advanced Timers - TIM1 and TIM8 */

#define STM32_TIM1_CR1            (STM32_TIM1_BASE + STM32_ATIM_CR1_OFFSET)
#define STM32_TIM1_CR2            (STM32_TIM1_BASE + STM32_ATIM_CR2_OFFSET)
#define STM32_TIM1_SMCR           (STM32_TIM1_BASE + STM32_ATIM_SMCR_OFFSET)
#define STM32_TIM1_DIER           (STM32_TIM1_BASE + STM32_ATIM_DIER_OFFSET)
#define STM32_TIM1_SR             (STM32_TIM1_BASE + STM32_ATIM_SR_OFFSET)
#define STM32_TIM1_EGR            (STM32_TIM1_BASE + STM32_ATIM_EGR_OFFSET)
#define STM32_TIM1_CCMR1          (STM32_TIM1_BASE + STM32_ATIM_CCMR1_OFFSET)
#define STM32_TIM1_CCMR2          (STM32_TIM1_BASE + STM32_ATIM_CCMR2_OFFSET)
#define STM32_TIM1_CCER           (STM32_TIM1_BASE + STM32_ATIM_CCER_OFFSET)
#define STM32_TIM1_CNT            (STM32_TIM1_BASE + STM32_ATIM_CNT_OFFSET)
#define STM32_TIM1_PSC            (STM32_TIM1_BASE + STM32_ATIM_PSC_OFFSET)
#define STM32_TIM1_ARR            (STM32_TIM1_BASE + STM32_ATIM_ARR_OFFSET)
#define STM32_TIM1_RCR            (STM32_TIM1_BASE + STM32_ATIM_RCR_OFFSET)
#define STM32_TIM1_CCR1           (STM32_TIM1_BASE + STM32_ATIM_CCR1_OFFSET)
#define STM32_TIM1_CCR2           (STM32_TIM1_BASE + STM32_ATIM_CCR2_OFFSET)
#define STM32_TIM1_CCR3           (STM32_TIM1_BASE + STM32_ATIM_CCR3_OFFSET)
#define STM32_TIM1_CCR4           (STM32_TIM1_BASE + STM32_ATIM_CCR4_OFFSET)
#define STM32_TIM1_BDTR           (STM32_TIM1_BASE + STM32_ATIM_BDTR_OFFSET)
#define STM32_TIM1_DCR            (STM32_TIM1_BASE + STM32_ATIM_DCR_OFFSET)
#define STM32_TIM1_DMAR           (STM32_TIM1_BASE + STM32_ATIM_DMAR_OFFSET)
#define STM32_TIM1_OR1            (STM32_TIM1_BASE + STM32_ATIM_OR1_OFFSET)
#define STM32_TIM1_CCMR3          (STM32_TIM1_BASE + STM32_ATIM_CCMR3_OFFSET)
#define STM32_TIM1_CCR5           (STM32_TIM1_BASE + STM32_ATIM_CCR5_OFFSET)
#define STM32_TIM1_CCR6           (STM32_TIM1_BASE + STM32_ATIM_CCR6_OFFSET)
#define STM32_TIM1_OR2            (STM32_TIM1_BASE + STM32_ATIM_OR2_OFFSET)
#define STM32_TIM1_OR3            (STM32_TIM1_BASE + STM32_ATIM_OR3_OFFSET)

#define STM32_TIM8_CR1            (STM32_TIM8_BASE + STM32_ATIM_CR1_OFFSET)
#define STM32_TIM8_CR2            (STM32_TIM8_BASE + STM32_ATIM_CR2_OFFSET)
#define STM32_TIM8_SMCR           (STM32_TIM8_BASE + STM32_ATIM_SMCR_OFFSET)
#define STM32_TIM8_DIER           (STM32_TIM8_BASE + STM32_ATIM_DIER_OFFSET)
#define STM32_TIM8_SR             (STM32_TIM8_BASE + STM32_ATIM_SR_OFFSET)
#define STM32_TIM8_EGR            (STM32_TIM8_BASE + STM32_ATIM_EGR_OFFSET)
#define STM32_TIM8_CCMR1          (STM32_TIM8_BASE + STM32_ATIM_CCMR1_OFFSET)
#define STM32_TIM8_CCMR2          (STM32_TIM8_BASE + STM32_ATIM_CCMR2_OFFSET)
#define STM32_TIM8_CCER           (STM32_TIM8_BASE + STM32_ATIM_CCER_OFFSET)
#define STM32_TIM8_CNT            (STM32_TIM8_BASE + STM32_ATIM_CNT_OFFSET)
#define STM32_TIM8_PSC            (STM32_TIM8_BASE + STM32_ATIM_PSC_OFFSET)
#define STM32_TIM8_ARR            (STM32_TIM8_BASE + STM32_ATIM_ARR_OFFSET)
#define STM32_TIM8_RCR            (STM32_TIM8_BASE + STM32_ATIM_RCR_OFFSET)
#define STM32_TIM8_CCR1           (STM32_TIM8_BASE + STM32_ATIM_CCR1_OFFSET)
#define STM32_TIM8_CCR2           (STM32_TIM8_BASE + STM32_ATIM_CCR2_OFFSET)
#define STM32_TIM8_CCR3           (STM32_TIM8_BASE + STM32_ATIM_CCR3_OFFSET)
#define STM32_TIM8_CCR4           (STM32_TIM8_BASE + STM32_ATIM_CCR4_OFFSET)
#define STM32_TIM8_BDTR           (STM32_TIM8_BASE + STM32_ATIM_BDTR_OFFSET)
#define STM32_TIM8_DCR            (STM32_TIM8_BASE + STM32_ATIM_DCR_OFFSET)
#define STM32_TIM8_DMAR           (STM32_TIM8_BASE + STM32_ATIM_DMAR_OFFSET)
#define STM32_TIM8_OR1            (STM32_TIM8_BASE + STM32_ATIM_OR1_OFFSET)
#define STM32_TIM8_CCMR3          (STM32_TIM8_BASE + STM32_ATIM_CCMR3_OFFSET)
#define STM32_TIM8_CCR5           (STM32_TIM8_BASE + STM32_ATIM_CCR5_OFFSET)
#define STM32_TIM8_CCR6           (STM32_TIM8_BASE + STM32_ATIM_CCR6_OFFSET)
#define STM32_TIM8_OR2            (STM32_TIM8_BASE + STM32_ATIM_OR2_OFFSET)
#define STM32_TIM8_OR3            (STM32_TIM8_BASE + STM32_ATIM_OR3_OFFSET)

/* 16-/32-bit General Timers - TIM2, TIM3, TIM4, TIM5, and TIM15-17.
 * TIM3 and 4 are 16-bit.
 * TIM2 and 5 are 32-bit.
 * TIM15, 16 and 17 are 16-bit.
 */

#define STM32_TIM2_CR1            (STM32_TIM2_BASE + STM32_GTIM_CR1_OFFSET)
#define STM32_TIM2_CR2            (STM32_TIM2_BASE + STM32_GTIM_CR2_OFFSET)
#define STM32_TIM2_SMCR           (STM32_TIM2_BASE + STM32_GTIM_SMCR_OFFSET)
#define STM32_TIM2_DIER           (STM32_TIM2_BASE + STM32_GTIM_DIER_OFFSET)
#define STM32_TIM2_SR             (STM32_TIM2_BASE + STM32_GTIM_SR_OFFSET)
#define STM32_TIM2_EGR            (STM32_TIM2_BASE + STM32_GTIM_EGR_OFFSET)
#define STM32_TIM2_CCMR1          (STM32_TIM2_BASE + STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM2_CCMR2          (STM32_TIM2_BASE + STM32_GTIM_CCMR2_OFFSET)
#define STM32_TIM2_CCER           (STM32_TIM2_BASE + STM32_GTIM_CCER_OFFSET)
#define STM32_TIM2_CNT            (STM32_TIM2_BASE + STM32_GTIM_CNT_OFFSET)
#define STM32_TIM2_PSC            (STM32_TIM2_BASE + STM32_GTIM_PSC_OFFSET)
#define STM32_TIM2_ARR            (STM32_TIM2_BASE + STM32_GTIM_ARR_OFFSET)
#define STM32_TIM2_CCR1           (STM32_TIM2_BASE + STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM2_CCR2           (STM32_TIM2_BASE + STM32_GTIM_CCR2_OFFSET)
#define STM32_TIM2_CCR3           (STM32_TIM2_BASE + STM32_GTIM_CCR3_OFFSET)
#define STM32_TIM2_CCR4           (STM32_TIM2_BASE + STM32_GTIM_CCR4_OFFSET)
#define STM32_TIM2_DCR            (STM32_TIM2_BASE + STM32_GTIM_DCR_OFFSET)
#define STM32_TIM2_DMAR           (STM32_TIM2_BASE + STM32_GTIM_DMAR_OFFSET)
#define STM32_TIM2_OR             (STM32_TIM2_BASE + STM32_GTIM_OR_OFFSET)

#define STM32_TIM3_CR1            (STM32_TIM3_BASE + STM32_GTIM_CR1_OFFSET)
#define STM32_TIM3_CR2            (STM32_TIM3_BASE + STM32_GTIM_CR2_OFFSET)
#define STM32_TIM3_SMCR           (STM32_TIM3_BASE + STM32_GTIM_SMCR_OFFSET)
#define STM32_TIM3_DIER           (STM32_TIM3_BASE + STM32_GTIM_DIER_OFFSET)
#define STM32_TIM3_SR             (STM32_TIM3_BASE + STM32_GTIM_SR_OFFSET)
#define STM32_TIM3_EGR            (STM32_TIM3_BASE + STM32_GTIM_EGR_OFFSET)
#define STM32_TIM3_CCMR1          (STM32_TIM3_BASE + STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM3_CCMR2          (STM32_TIM3_BASE + STM32_GTIM_CCMR2_OFFSET)
#define STM32_TIM3_CCER           (STM32_TIM3_BASE + STM32_GTIM_CCER_OFFSET)
#define STM32_TIM3_CNT            (STM32_TIM3_BASE + STM32_GTIM_CNT_OFFSET)
#define STM32_TIM3_PSC            (STM32_TIM3_BASE + STM32_GTIM_PSC_OFFSET)
#define STM32_TIM3_ARR            (STM32_TIM3_BASE + STM32_GTIM_ARR_OFFSET)
#define STM32_TIM3_CCR1           (STM32_TIM3_BASE + STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM3_CCR2           (STM32_TIM3_BASE + STM32_GTIM_CCR2_OFFSET)
#define STM32_TIM3_CCR3           (STM32_TIM3_BASE + STM32_GTIM_CCR3_OFFSET)
#define STM32_TIM3_CCR4           (STM32_TIM3_BASE + STM32_GTIM_CCR4_OFFSET)
#define STM32_TIM3_DCR            (STM32_TIM3_BASE + STM32_GTIM_DCR_OFFSET)
#define STM32_TIM3_DMAR           (STM32_TIM3_BASE + STM32_GTIM_DMAR_OFFSET)

