apache/nuttx/arch/arm/src/stm32u5/hardware/stm32u5_tim.h
#define STM32_TIM4_CR1            (STM32_TIM4_BASE + STM32_GTIM_CR1_OFFSET)
#define STM32_TIM4_CR2            (STM32_TIM4_BASE + STM32_GTIM_CR2_OFFSET)
#define STM32_TIM4_SMCR           (STM32_TIM4_BASE + STM32_GTIM_SMCR_OFFSET)
#define STM32_TIM4_DIER           (STM32_TIM4_BASE + STM32_GTIM_DIER_OFFSET)
#define STM32_TIM4_SR             (STM32_TIM4_BASE + STM32_GTIM_SR_OFFSET)
#define STM32_TIM4_EGR            (STM32_TIM4_BASE + STM32_GTIM_EGR_OFFSET)
#define STM32_TIM4_CCMR1          (STM32_TIM4_BASE + STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM4_CCMR2          (STM32_TIM4_BASE + STM32_GTIM_CCMR2_OFFSET)
#define STM32_TIM4_CCER           (STM32_TIM4_BASE + STM32_GTIM_CCER_OFFSET)
#define STM32_TIM4_CNT            (STM32_TIM4_BASE + STM32_GTIM_CNT_OFFSET)
#define STM32_TIM4_PSC            (STM32_TIM4_BASE + STM32_GTIM_PSC_OFFSET)
#define STM32_TIM4_ARR            (STM32_TIM4_BASE + STM32_GTIM_ARR_OFFSET)
#define STM32_TIM4_CCR1           (STM32_TIM4_BASE + STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM4_CCR2           (STM32_TIM4_BASE + STM32_GTIM_CCR2_OFFSET)
#define STM32_TIM4_CCR3           (STM32_TIM4_BASE + STM32_GTIM_CCR3_OFFSET)
#define STM32_TIM4_CCR4           (STM32_TIM4_BASE + STM32_GTIM_CCR4_OFFSET)
#define STM32_TIM4_DCR            (STM32_TIM4_BASE + STM32_GTIM_DCR_OFFSET)
#define STM32_TIM4_DMAR           (STM32_TIM4_BASE + STM32_GTIM_DMAR_OFFSET)

#define STM32_TIM5_CR1            (STM32_TIM5_BASE + STM32_GTIM_CR1_OFFSET)
#define STM32_TIM5_CR2            (STM32_TIM5_BASE + STM32_GTIM_CR2_OFFSET)
#define STM32_TIM5_SMCR           (STM32_TIM5_BASE + STM32_GTIM_SMCR_OFFSET)
#define STM32_TIM5_DIER           (STM32_TIM5_BASE + STM32_GTIM_DIER_OFFSET)
#define STM32_TIM5_SR             (STM32_TIM5_BASE + STM32_GTIM_SR_OFFSET)
#define STM32_TIM5_EGR            (STM32_TIM5_BASE + STM32_GTIM_EGR_OFFSET)
#define STM32_TIM5_CCMR1          (STM32_TIM5_BASE + STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM5_CCMR2          (STM32_TIM5_BASE + STM32_GTIM_CCMR2_OFFSET)
#define STM32_TIM5_CCER           (STM32_TIM5_BASE + STM32_GTIM_CCER_OFFSET)
#define STM32_TIM5_CNT            (STM32_TIM5_BASE + STM32_GTIM_CNT_OFFSET)
#define STM32_TIM5_PSC            (STM32_TIM5_BASE + STM32_GTIM_PSC_OFFSET)
#define STM32_TIM5_ARR            (STM32_TIM5_BASE + STM32_GTIM_ARR_OFFSET)
#define STM32_TIM5_CCR1           (STM32_TIM5_BASE + STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM5_CCR2           (STM32_TIM5_BASE + STM32_GTIM_CCR2_OFFSET)
#define STM32_TIM5_CCR3           (STM32_TIM5_BASE + STM32_GTIM_CCR3_OFFSET)
#define STM32_TIM5_CCR4           (STM32_TIM5_BASE + STM32_GTIM_CCR4_OFFSET)
#define STM32_TIM5_DCR            (STM32_TIM5_BASE + STM32_GTIM_DCR_OFFSET)
#define STM32_TIM5_DMAR           (STM32_TIM5_BASE + STM32_GTIM_DMAR_OFFSET)
#define STM32_TIM5_OR             (STM32_TIM5_BASE + STM32_GTIM_OR_OFFSET)

#define STM32_TIM15_CR1           (STM32_TIM15_BASE + STM32_GTIM_CR1_OFFSET)
#define STM32_TIM15_CR2           (STM32_TIM15_BASE + STM32_GTIM_CR2_OFFSET)
#define STM32_TIM15_SMCR          (STM32_TIM15_BASE + STM32_GTIM_SMCR_OFFSET)
#define STM32_TIM15_DIER          (STM32_TIM15_BASE + STM32_GTIM_DIER_OFFSET)
#define STM32_TIM15_SR            (STM32_TIM15_BASE + STM32_GTIM_SR_OFFSET)
#define STM32_TIM15_EGR           (STM32_TIM15_BASE + STM32_GTIM_EGR_OFFSET)
#define STM32_TIM15_CCMR1         (STM32_TIM15_BASE + STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM15_CCER          (STM32_TIM15_BASE + STM32_GTIM_CCER_OFFSET)
#define STM32_TIM15_CNT           (STM32_TIM15_BASE + STM32_GTIM_CNT_OFFSET)
#define STM32_TIM15_PSC           (STM32_TIM15_BASE + STM32_GTIM_PSC_OFFSET)
#define STM32_TIM15_ARR           (STM32_TIM15_BASE + STM32_GTIM_ARR_OFFSET)
#define STM32_TIM15_RCR           (STM32_TIM15_BASE + STM32_GTIM_RCR_OFFSET)
#define STM32_TIM15_CCR1          (STM32_TIM15_BASE + STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM15_CCR2          (STM32_TIM15_BASE + STM32_GTIM_CCR2_OFFSET)
#define STM32_TIM15_BDTR          (STM32_TIM15_BASE + STM32_GTIM_BDTR_OFFSET)
#define STM32_TIM15_DCR           (STM32_TIM15_BASE + STM32_GTIM_DCR_OFFSET)
#define STM32_TIM15_DMAR          (STM32_TIM15_BASE + STM32_GTIM_DMAR_OFFSET)

#define STM32_TIM16_CR1           (STM32_TIM16_BASE + STM32_GTIM_CR1_OFFSET)
#define STM32_TIM16_CR2           (STM32_TIM16_BASE + STM32_GTIM_CR2_OFFSET)
#define STM32_TIM16_DIER          (STM32_TIM16_BASE + STM32_GTIM_DIER_OFFSET)
#define STM32_TIM16_SR            (STM32_TIM16_BASE + STM32_GTIM_SR_OFFSET)
#define STM32_TIM16_EGR           (STM32_TIM16_BASE + STM32_GTIM_EGR_OFFSET)
#define STM32_TIM16_CCMR1         (STM32_TIM16_BASE + STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM16_CCER          (STM32_TIM16_BASE + STM32_GTIM_CCER_OFFSET)
#define STM32_TIM16_CNT           (STM32_TIM16_BASE + STM32_GTIM_CNT_OFFSET)
#define STM32_TIM16_PSC           (STM32_TIM16_BASE + STM32_GTIM_PSC_OFFSET)
#define STM32_TIM16_ARR           (STM32_TIM16_BASE + STM32_GTIM_ARR_OFFSET)
#define STM32_TIM16_RCR           (STM32_TIM16_BASE + STM32_GTIM_RCR_OFFSET)
#define STM32_TIM16_CCR1          (STM32_TIM16_BASE + STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM16_BDTR          (STM32_TIM16_BASE + STM32_GTIM_BDTR_OFFSET)
#define STM32_TIM16_DCR           (STM32_TIM16_BASE + STM32_GTIM_DCR_OFFSET)
#define STM32_TIM16_DMAR          (STM32_TIM16_BASE + STM32_GTIM_DMAR_OFFSET)
#define STM32_TIM16_OR            (STM32_TIM16_BASE + STM32_GTIM_OR_OFFSET)

#define STM32_TIM17_CR1           (STM32_TIM17_BASE + STM32_GTIM_CR1_OFFSET)
#define STM32_TIM17_CR2           (STM32_TIM17_BASE + STM32_GTIM_CR2_OFFSET)
#define STM32_TIM17_DIER          (STM32_TIM17_BASE + STM32_GTIM_DIER_OFFSET)
#define STM32_TIM17_SR            (STM32_TIM17_BASE + STM32_GTIM_SR_OFFSET)
#define STM32_TIM17_EGR           (STM32_TIM17_BASE + STM32_GTIM_EGR_OFFSET)
#define STM32_TIM17_CCMR1         (STM32_TIM17_BASE + STM32_GTIM_CCMR1_OFFSET)
#define STM32_TIM17_CCER          (STM32_TIM17_BASE + STM32_GTIM_CCER_OFFSET)
#define STM32_TIM17_CNT           (STM32_TIM17_BASE + STM32_GTIM_CNT_OFFSET)
#define STM32_TIM17_PSC           (STM32_TIM17_BASE + STM32_GTIM_PSC_OFFSET)
#define STM32_TIM17_ARR           (STM32_TIM17_BASE + STM32_GTIM_ARR_OFFSET)
#define STM32_TIM17_RCR           (STM32_TIM17_BASE + STM32_GTIM_RCR_OFFSET)
#define STM32_TIM17_CCR1          (STM32_TIM17_BASE + STM32_GTIM_CCR1_OFFSET)
#define STM32_TIM17_BDTR          (STM32_TIM17_BASE + STM32_GTIM_BDTR_OFFSET)
#define STM32_TIM17_DCR           (STM32_TIM17_BASE + STM32_GTIM_DCR_OFFSET)
#define STM32_TIM17_DMAR          (STM32_TIM17_BASE + STM32_GTIM_DMAR_OFFSET)

/* Basic Timers - TIM6 and TIM7 */

#define STM32_TIM6_CR1            (STM32_TIM6_BASE + STM32_BTIM_CR1_OFFSET)
#define STM32_TIM6_CR2            (STM32_TIM6_BASE + STM32_BTIM_CR2_OFFSET)
#define STM32_TIM6_DIER           (STM32_TIM6_BASE + STM32_BTIM_DIER_OFFSET)
#define STM32_TIM6_SR             (STM32_TIM6_BASE + STM32_BTIM_SR_OFFSET)
#define STM32_TIM6_EGR            (STM32_TIM6_BASE + STM32_BTIM_EGR_OFFSET)
#define STM32_TIM6_CNT            (STM32_TIM6_BASE + STM32_BTIM_CNT_OFFSET)
#define STM32_TIM6_PSC            (STM32_TIM6_BASE + STM32_BTIM_PSC_OFFSET)
#define STM32_TIM6_ARR            (STM32_TIM6_BASE + STM32_BTIM_ARR_OFFSET)

