apache/nuttx/arch/arm/src/stm32u5/hardware/stm32u5_tim.h
#define STM32_TIM7_CR1            (STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET)
#define STM32_TIM7_CR2            (STM32_TIM7_BASE + STM32_BTIM_CR2_OFFSET)
#define STM32_TIM7_DIER           (STM32_TIM7_BASE + STM32_BTIM_DIER_OFFSET)
#define STM32_TIM7_SR             (STM32_TIM7_BASE + STM32_BTIM_SR_OFFSET)
#define STM32_TIM7_EGR            (STM32_TIM7_BASE + STM32_BTIM_EGR_OFFSET)
#define STM32_TIM7_CNT            (STM32_TIM7_BASE + STM32_BTIM_CNT_OFFSET)
#define STM32_TIM7_PSC            (STM32_TIM7_BASE + STM32_BTIM_PSC_OFFSET)
#define STM32_TIM7_ARR            (STM32_TIM7_BASE + STM32_BTIM_ARR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Control register 1 */

#define ATIM_CR1_CEN                (1 << 0)                  /* Bit 0: Counter enable */
#define ATIM_CR1_UDIS               (1 << 1)                  /* Bit 1: Update disable */
#define ATIM_CR1_URS                (1 << 2)                  /* Bit 2: Update request source */
#define ATIM_CR1_OPM                (1 << 3)                  /* Bit 3: One pulse mode */
#define ATIM_CR1_DIR                (1 << 4)                  /* Bit 4: Direction */
#define ATIM_CR1_CMS_SHIFT          (5)                       /* Bits 6-5: Center-aligned mode selection */
#define ATIM_CR1_CMS_MASK           (3 << ATIM_CR1_CMS_SHIFT)
#  define ATIM_CR1_EDGE             (0 << ATIM_CR1_CMS_SHIFT) /* 00: Edge-aligned mode */
#  define ATIM_CR1_CENTER1          (1 << ATIM_CR1_CMS_SHIFT) /* 01: Center-aligned mode 1 */
#  define ATIM_CR1_CENTER2          (2 << ATIM_CR1_CMS_SHIFT) /* 10: Center-aligned mode 2 */
#  define ATIM_CR1_CENTER3          (3 << ATIM_CR1_CMS_SHIFT) /* 11: Center-aligned mode 3 */
#define ATIM_CR1_ARPE               (1 << 7)                  /* Bit 7: Auto-reload preload enable */
#define ATIM_CR1_CKD_SHIFT          (8)                       /* Bits 9-8: Clock division */
#define ATIM_CR1_CKD_MASK           (3 << ATIM_CR1_CKD_SHIFT)
#  define ATIM_CR1_TCKINT           (0 << ATIM_CR1_CKD_SHIFT) /* 00: tDTS=tCK_INT */
#  define ATIM_CR1_2TCKINT          (1 << ATIM_CR1_CKD_SHIFT) /* 01: tDTS=2*tCK_INT */
#  define ATIM_CR1_4TCKINT          (2 << ATIM_CR1_CKD_SHIFT) /* 10: tDTS=4*tCK_INT */
#define ATIM_CR1_UIFREMAP           (1 << 11)                 /* Bit 11: UIF status bit remapping */

/* Control register 2 */

#define ATIM_CR2_CCPC               (1 << 0)                    /* Bit 0:  Capture/Compare Preloaded Control */
#define ATIM_CR2_CCUS               (1 << 2)                    /* Bit 2:  Capture/Compare Control Update Selection */
#define ATIM_CR2_CCDS               (1 << 3)                    /* Bit 3:  Capture/Compare DMA Selection */
#define ATIM_CR2_MMS_SHIFT          (4)                         /* Bits 6-4: Master Mode Selection */
#define ATIM_CR2_MMS_MASK           (7 << ATIM_CR2_MMS_SHIFT)
#  define ATIM_CR2_MMS_RESET        (0 << ATIM_CR2_MMS_SHIFT)   /* 000: Reset - TIMx_EGR UG bit is TRGO */
#  define ATIM_CR2_MMS_ENABLE       (1 << ATIM_CR2_MMS_SHIFT)   /* 001: Enable - CNT_EN is TRGO */
#  define ATIM_CR2_MMS_UPDATE       (2 << ATIM_CR2_MMS_SHIFT)   /* 010: Update event is TRGO */
#  define ATIM_CR2_MMS_COMPP        (3 << ATIM_CR2_MMS_SHIFT)   /* 010: Compare Pulse - CC1IF flag */
#  define ATIM_CR2_MMS_OC1REF       (4 << ATIM_CR2_MMS_SHIFT)   /* 100: Compare OC1REF is TRGO */
#  define ATIM_CR2_MMS_OC2REF       (5 << ATIM_CR2_MMS_SHIFT)   /* 101: Compare OC2REF is TRGO */
#  define ATIM_CR2_MMS_OC3REF       (6 << ATIM_CR2_MMS_SHIFT)   /* 110: Compare OC3REF is TRGO */
#  define ATIM_CR2_MMS_OC4REF       (7 << ATIM_CR2_MMS_SHIFT)   /* 111: Compare OC4REF is TRGO */
#define ATIM_CR2_TI1S               (1 << 7)                    /* Bit 7: TI1 Selection */
#define ATIM_CR2_OIS1               (1 << 8)                    /* Bit 8:  Output Idle state 1 (OC1 output) */
#define ATIM_CR2_OIS1N              (1 << 9)                    /* Bit 9:  Output Idle state 1 (OC1N output) */
#define ATIM_CR2_OIS2               (1 << 10)                   /* Bit 10: Output Idle state 2 (OC2 output) */
#define ATIM_CR2_OIS2N              (1 << 11)                   /* Bit 11: Output Idle state 2 (OC2N output) */
#define ATIM_CR2_OIS3               (1 << 12)                   /* Bit 12: Output Idle state 3 (OC3 output) */
#define ATIM_CR2_OIS3N              (1 << 13)                   /* Bit 13: Output Idle state 3 (OC3N output) */
#define ATIM_CR2_OIS4               (1 << 14)                   /* Bit 14: Output Idle state 4 (OC4 output) */
#define ATIM_CR2_OIS5               (1 << 16)                   /* Bit 16: Output Idle state 5 (OC5 output) */
#define ATIM_CR2_OIS6               (1 << 18)                   /* Bit 18: Output Idle state 6 (OC6 output) */
#define ATIM_CR2_MMS2_SHIFT         (20)                        /* Bits 20-23: Master Mode Selection 2 */
#define ATIM_CR2_MMS2_MASK          (15 << ATIM_CR2_MMS2_SHIFT)
#  define ATIM_CR2_MMS2_RESET       (0 << ATIM_CR2_MMS2_SHIFT)  /* 0000: Reset - TIMx_EGR UG bit is TRG9 */
#  define ATIM_CR2_MMS2_ENABLE      (1 << ATIM_CR2_MMS2_SHIFT)  /* 0001: Enable - CNT_EN is TRGO2 */
#  define ATIM_CR2_MMS2_UPDATE      (2 << ATIM_CR2_MMS2_SHIFT)  /* 0010: Update event is TRGH0*/
#  define ATIM_CR2_MMS2_COMPP       (3 << ATIM_CR2_MMS2_SHIFT)  /* 0010: Compare Pulse - CC1IF flag */
#  define ATIM_CR2_MMS2_OC1REF      (4 << ATIM_CR2_MMS2_SHIFT)  /* 0100: Compare OC1REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC2REF      (5 << ATIM_CR2_MMS2_SHIFT)  /* 0101: Compare OC2REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC3REF      (6 << ATIM_CR2_MMS2_SHIFT)  /* 0110: Compare OC3REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC4REF      (7 << ATIM_CR2_MMS2_SHIFT)  /* 0111: Compare OC4REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC5REF      (8 << ATIM_CR2_MMS2_SHIFT)  /* 1000: Compare OC5REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC6REF      (9 << ATIM_CR2_MMS2_SHIFT)  /* 1001: Compare OC6REF is TRGO2 */
#  define ATIM_CR2_MMS2_CMPOC4      (10 << ATIM_CR2_MMS2_SHIFT) /* 1010: Compare pulse - OC4REF edge is TRGO2 */
#  define ATIM_CR2_MMS2_CMPOC6      (11 << ATIM_CR2_MMS2_SHIFT) /* 1011: Compare pulse - OC6REF edge is TRGO2 */
#  define ATIM_CR2_MMS2_CMPOC4R6R   (12 << ATIM_CR2_MMS2_SHIFT) /* 1100: Compare pulse - OC4REF/OC6REF rising */
#  define ATIM_CR2_MMS2_CMPOC4R6F   (13 << ATIM_CR2_MMS2_SHIFT) /* 1101: Compare pulse - OC4REF rising/OC6REF falling */
#  define ATIM_CR2_MMS2_CMPOC5R6R   (14 << ATIM_CR2_MMS2_SHIFT) /* 1110: Compare pulse - OC5REF/OC6REF rising */
#  define ATIM_CR2_MMS2_CMPOC5R6F   (15 << ATIM_CR2_MMS2_SHIFT) /* 1111: Compare pulse - OC5REF rising/OC6REF falling */

/* Slave mode control register */

#define ATIM_SMCR_SMS_SHIFT       (0)                         /* Bits 0-2: Slave mode selection */
#define ATIM_SMCR_SMS_MASK        (7 << ATIM_SMCR_SMS_SHIFT)
#  define ATIM_SMCR_DISAB         (0 << ATIM_SMCR_SMS_SHIFT)  /* 000: Slave mode disabled */
#  define ATIM_SMCR_ENCMD1        (1 << ATIM_SMCR_SMS_SHIFT)  /* 001: Encoder mode 1 */
#  define ATIM_SMCR_ENCMD2        (2 << ATIM_SMCR_SMS_SHIFT)  /* 010: Encoder mode 2 */
#  define ATIM_SMCR_ENCMD3        (3 << ATIM_SMCR_SMS_SHIFT)  /* 011: Encoder mode 3 */
#  define ATIM_SMCR_RESET         (4 << ATIM_SMCR_SMS_SHIFT)  /* 100: Reset Mode */
#  define ATIM_SMCR_GATED         (5 << ATIM_SMCR_SMS_SHIFT)  /* 101: Gated Mode */
#  define ATIM_SMCR_TRIGGER       (6 << ATIM_SMCR_SMS_SHIFT)  /* 110: Trigger Mode */
#  define ATIM_SMCR_EXTCLK1       (7 << ATIM_SMCR_SMS_SHIFT)  /* 111: External Clock Mode 1 */
#define ATIM_SMCR_OCCS            (1 << 3)                    /* Bit 3: OCREF clear selection */
#define ATIM_SMCR_TS_SHIFT        (4)                         /* Bits 4-6: Trigger selection */
#define ATIM_SMCR_TS_MASK         (7 << ATIM_SMCR_TS_SHIFT)
#  define ATIM_SMCR_ITR0          (0 << ATIM_SMCR_TS_SHIFT)   /* 000: Internal trigger 0 (ITR0) */
#  define ATIM_SMCR_ITR1          (1 << ATIM_SMCR_TS_SHIFT)   /* 001: Internal trigger 1 (ITR1) */
#  define ATIM_SMCR_ITR2          (2 << ATIM_SMCR_TS_SHIFT)   /* 010: Internal trigger 2 (ITR2) */
#  define ATIM_SMCR_ITR3          (3 << ATIM_SMCR_TS_SHIFT)   /* 011: Internal trigger 3 (ITR3) */
#  define ATIM_SMCR_T1FED         (4 << ATIM_SMCR_TS_SHIFT)   /* 100: TI1 Edge Detector (TI1F_ED) */
#  define ATIM_SMCR_TI1FP1        (5 << ATIM_SMCR_TS_SHIFT)   /* 101: Filtered Timer Input 1 (TI1FP1) */
#  define ATIM_SMCR_T12FP2        (6 << ATIM_SMCR_TS_SHIFT)   /* 110: Filtered Timer Input 2 (TI2FP2) */
#  define ATIM_SMCR_ETRF          (7 << ATIM_SMCR_TS_SHIFT)   /* 111: External Trigger input (ETRF) */
#define ATIM_SMCR_MSM             (1 << 7)                    /* Bit 7: Master/slave mode */
#define ATIM_SMCR_ETF_SHIFT       (8)                         /* Bits 8-11: External trigger filter */
#define ATIM_SMCR_ETF_MASK        (0x0f << ATIM_SMCR_ETF_SHIFT)
#  define ATIM_SMCR_NOFILT        (0 << ATIM_SMCR_ETF_SHIFT)  /* 0000: No filter, sampling is done at fDTS */
#  define ATIM_SMCR_FCKINT2       (1 << ATIM_SMCR_ETF_SHIFT)  /* 0001: fSAMPLING=fCK_INT, N=2 */
#  define ATIM_SMCR_FCKINT4       (2 << ATIM_SMCR_ETF_SHIFT)  /* 0010: fSAMPLING=fCK_INT, N=4 */
#  define ATIM_SMCR_FCKINT8       (3 << ATIM_SMCR_ETF_SHIFT)  /* 0011: fSAMPLING=fCK_INT, N=8 */
#  define ATIM_SMCR_FDTSd26       (4 << ATIM_SMCR_ETF_SHIFT)  /* 0100: fSAMPLING=fDTS/2, N=6 */
#  define ATIM_SMCR_FDTSd28       (5 << ATIM_SMCR_ETF_SHIFT)  /* 0101: fSAMPLING=fDTS/2, N=8 */
#  define ATIM_SMCR_FDTSd46       (6 << ATIM_SMCR_ETF_SHIFT)  /* 0110: fSAMPLING=fDTS/4, N=6 */
#  define ATIM_SMCR_FDTSd48       (7 << ATIM_SMCR_ETF_SHIFT)  /* 0111: fSAMPLING=fDTS/4, N=8 */
#  define ATIM_SMCR_FDTSd86       (8 << ATIM_SMCR_ETF_SHIFT)  /* 1000: fSAMPLING=fDTS/8, N=6 */
#  define ATIM_SMCR_FDTSd88       (9 << ATIM_SMCR_ETF_SHIFT)  /* 1001: fSAMPLING=fDTS/8, N=8 */
#  define ATIM_SMCR_FDTSd165      (10 << ATIM_SMCR_ETF_SHIFT) /* 1010: fSAMPLING=fDTS/16, N=5 */
#  define ATIM_SMCR_FDTSd166      (11 << ATIM_SMCR_ETF_SHIFT) /* 1011: fSAMPLING=fDTS/16, N=6 */
#  define ATIM_SMCR_FDTSd168      (12 << ATIM_SMCR_ETF_SHIFT) /* 1100: fSAMPLING=fDTS/16, N=8 */
#  define ATIM_SMCR_FDTSd325      (13 << ATIM_SMCR_ETF_SHIFT) /* 1101: fSAMPLING=fDTS/32, N=5 */
#  define ATIM_SMCR_FDTSd326      (14 << ATIM_SMCR_ETF_SHIFT) /* 1110: fSAMPLING=fDTS/32, N=6 */
#  define ATIM_SMCR_FDTSd328      (15 << ATIM_SMCR_ETF_SHIFT) /* 1111: fSAMPLING=fDTS/32, N=8 */
#define ATIM_SMCR_ETPS_SHIFT      (12)                        /* Bits 12-13: External trigger prescaler */
#define ATIM_SMCR_ETPS_MASK       (3 << ATIM_SMCR_ETPS_SHIFT)
#  define ATIM_SMCR_PSCOFF        (0 << ATIM_SMCR_ETPS_SHIFT) /* 00: Prescaler OFF */
#  define ATIM_SMCR_ETRPd2        (1 << ATIM_SMCR_ETPS_SHIFT) /* 01: ETRP frequency divided by 2 */
#  define ATIM_SMCR_ETRPd4        (2 << ATIM_SMCR_ETPS_SHIFT) /* 10: ETRP frequency divided by 4 */
#  define ATIM_SMCR_ETRPd8        (3 << ATIM_SMCR_ETPS_SHIFT) /* 11: ETRP frequency divided by 8 */
#define ATIM_SMCR_ECE             (1 << 14)                   /* Bit 14: External clock enable */
#define ATIM_SMCR_ETP             (1 << 15)                   /* Bit 15: External trigger polarity */
#define ATIM_SMCR_SMS             (1 << 16)                   /* Bit 16: Slave mode selection - bit 3 */

